# üë©üèª‚Äçüíª Pandas DataFrame Apply

#### ¬ª Importing the Pandas and Numpy libraries

In [7]:
import pandas as pd
import numpy as np

#### ¬ª Creating a DataFrame with a dictionary

In [8]:
df = pd.DataFrame({"var1": [1,5,2,8,0,4],
                   "var2": [4,3,6,8,3,2]})

In [9]:
df

   var1  var2
0     1     4
1     5     3
2     2     6
3     8     8
4     0     3
5     4     2

#### ¬ª Applying NumPy sum to each column

In [10]:
df.apply(np.sum)

var1    20
var2    26
dtype: int64

#### ¬ª Applying NumPy mean to each column

In [11]:
df.apply(np.mean)

var1    3.333333
var2    4.333333
dtype: float64

#### ¬ª Creating a new DataFrame with group labels

In [12]:
df = pd.DataFrame({"groups": ["a", "b", "c", "a", "b", "c"],
                   "var1": [1,5,2,8,0,4],
                   "var2": [4,3,6,8,3,2]})

In [13]:
df

  groups  var1  var2
0      a     1     4
1      b     5     3
2      c     2     6
3      a     8     8
4      b     0     3
5      c     4     2

#### ¬ª Applying sum function to each group

In [15]:
df.groupby("groups").apply(np.sum, axis=0, include_groups=False)

        var1  var2
groups
a          9    12
b          5     6
c          6     8

#### ¬ª Applying mean function to each group

In [21]:
df.groupby("groups").apply(np.mean, axis=0)

        var1  var2
groups
a        4.5   6.0
b        2.5   3.0
c        3.0   4.0